Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.SetValues(System.Collections.Generic.ICollection{Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue})
Sets the value set to the demand factor definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.RemoveValue(Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue)
Removes a value to the value set for this demand factor definition
dfValue:
Value to remove from the set
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.AddValue(Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue)
Adds a value to the value set for this demand factor definition
dfValue:
Value to add to the set
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new instance of a demand factor definition.
ADoc:
The document where the element will be created and added.
strName:
The name of the electrical demand factor definition to be created.
Returns:
The newly created demand factor definition element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011